-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2017-11-24 14:09:47
-- 服务器版本： 5.7.14
-- PHP Version: 7.0.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `csulovewall`
--

-- --------------------------------------------------------

--
-- 表的结构 `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `lid` int(11) NOT NULL,
  `content` varchar(200) NOT NULL,
  `time` varchar(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `comments`
--

INSERT INTO `comments` (`id`, `lid`, `content`, `time`) VALUES
(1, 1, 'w辣鸡', '1493294777'),
(2, 1, 'sjkdf sk ', '234234242342'),
(3, 1, 'zhazha', '1493296477'),
(4, 28, '我也喜欢你', '1493296749'),
(5, 9, 'I love 有', '1493297128'),
(6, 9, '我一下也细化你呀', '1493297189'),
(7, 28, '我喜欢你呀', '1493298291'),
(8, 1, '真的喜欢你呀', '1493298648'),
(9, 27, 'laji ', '1493345855'),
(10, 30, '辣鸡头像', '1493388119'),
(11, 30, '头像不错唉', '1493388129'),
(12, 10, '2133', '1493610333'),
(13, 19, '123', '1493610370'),
(14, 13, '123', '1493610500');

-- --------------------------------------------------------

--
-- 表的结构 `lovecontent`
--

CREATE TABLE `lovecontent` (
  `id` int(11) NOT NULL,
  `name` varchar(20) DEFAULT 'CSU匿名表白者',
  `content` varchar(300) NOT NULL,
  `image` text,
  `time` varchar(20) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `lovecontent`
--

INSERT INTO `lovecontent` (`id`, `name`, `content`, `image`, `time`) VALUES
(1, '李芳艳', '太多的美好都留在了中南，真的是往事不堪回首……记得大二时班上男生为我们准备了女生节爱心早餐，那个时候好像长沙还比较冷，大清早一群男生等在女生宿舍门口，拎着包子和豆浆，突然感觉信管的男生虽然低调，但很暖……大三的女生节是心愿墙，还记得一女生的愿望是要一扫把，我当时好像要的是帮忙带饭……一切都像在昨天，一切都回不到从前，中南的姑娘们，珍惜现在。', '12.png', '1493564355'),
(2, 'Elva', '作为工科专业中班级男女比例1:2的奇葩专业生医的一名妹子，大学四年基本上只能在女生节感受到女生在工科专业应有的小公举待遇。毕业大半年，不知道今年的中南校园的女生节横幅有什么精彩内容，以后再也不会有人为我们挂横幅庆祝女生节了，听着歌，泪水止不住。', '25.png', '1493564366'),
(3, 'Mars', '最爱的音乐《南方姑娘》，没有之一。感谢小南，让最爱的母校和最爱的音乐有一个邂逅。虽然我没有一个南方姑娘，但是我有一个中南姑娘呀！和中南姑娘在一起的第1160天，离开中南第二个年头也是异地第二个，甚是想念中南和我的中南姑娘。', '36.png', '1493564390'),
(4, '琼', '喜欢新校那一路的玉兰花，那一摊绿水。喜欢湘雅那安静满满的图书馆，那每日钻研讨论的热情。中南最美，愿我的中南时光一直灿烂。', '25.png', '1493564403'),
(5, '般若', '今年已经毕业13年了，幸运的是我们两个中南人组成的家庭非常幸福美满，从青春年少的男孩和姑娘到逐渐迈入中年，不变的是那颗中南的心，期盼着以后带两个孩子回中南，让他们走走我们曾经走过的路，听听那时我们的故', '23.png', '1493564416'),
(6, '孙嘉悦', '毕业快两年了，早起发现楼下已经有拿着鲜花耐心等待着的男孩子，想起中南每年女生节的火热与激情，从南校到新校的一路上的多彩多样的横幅标语，不禁非常想念我大中南的小伙伴。第一次看到留言篇幅比正文还长，细细读来，多是在外游子或是即将毕业的在校生对母校满满的怀念和不舍。', '6.png', '1493564428'),
(7, '罗筱筱花', '在中南第七年，很幸运在毕业的尾巴牵手了一位中南姑娘，我在南校，她在湘雅，最期待的就是周末可以呆在一块。不管以后走到哪，做什么工作，都希望可以和她一直在一起，一起变得更好。', '39.png', '1493564437'),
(8, 'Lan Xiting^ω^', '海外博士一枚，坐标伦敦，这里中南校友不少，且都工作认真，给人印象很好。现在听说谁是中南来的，其他人都认为会是个学霸，工作努力没得跑。母校是我们的骄傲，我们也在努力不会辜负母校的名誉！', '27.png', '1493564446'),
(9, 'CSU匿名爱恋者', '我虽不是中南姑娘，但是中南有太多的回忆，以前每天排队等图书馆开门看书，在冷风中瑟瑟发抖，还手里一本书，嘴里念叨着今天要背的内容；也曾躺在有些杨柳树下的青草地上，只为了享受夕阳渐渐褪去的美景；也曾步履匆匆的穿梭在后湖和C栋教学楼之间；也曾围着图书馆一圈又一圈的晚跑，我突然很想念那些时光，想念我在那的半年时光，我希望接下的机会可以让我真正的触碰中南，我希望遇见一个中南男孩。', '38.png', '1493564460'),
(10, 'Yan', '  在感人的歌声中浏览评论，每条都透露着浓浓的怀念，怀念大学，怀念青春，怀念爱情友情，怀念每个踏足的角落，怀念在那里遇到的你我，怀念一起走过的日子，怀念或痛或快乐……太多说不完的情结难以忘怀，那就是我们心中的中南。', '16.png', '1493564474'),
(11, 'CSU匿名爱恋者', '这里曾经是异乡 却终成了故乡。想回到自己的故乡，想回家看看。', '13.png', '1493564483'),
(12, 'CSU匿名爱恋者', '中南男生娶了一位中南姑娘，这首歌突然将我带到了六七年前的某一天，我和我的姑娘，可能正漫步在南校的操场，可能正徜徉在南校门口的商业街，可能正沉醉在荷叶和知了渲染过的池塘，可能在自习室里拼命复习，可能穿过本部的小山路登上了岳麓山，也可能正在读一条条趣味横生、“污”心“污”肺的女生节横幅……现在的我们在另外一座城市，仍然会做和以前类似的事情，一直很幸福！', '7.png', '1493564496'),
(13, 'CSU匿名爱恋者', '有幸在中南待了七年！ 有幸在中南找到了另一半！ 有幸仍留在长沙！ 有幸能常回母校看看！ 有幸在毕业后仍能听到如此动听的歌声，勾起我们最最美好的青春回忆！', '26.png', '1493564511'),
(14, '阿超', ' 深夜码论文，即将研究生毕业，虽然不在中南读研，但一直牵挂着中南的一举一动，一草一木，想着，母校，应该也是惦念着我们这些漂泊在外的“中南姑娘”吧湿了眼眶，暖了心房。', '8.png', '1493564522'),
(15, 'CSU匿名爱恋者', ' 中南姑娘，从内到外始终散发美的气息中南姑娘，是湘水畔麓山侧最美的风景。愿所有的中南姑娘，幸福美好。 ps:@兰朵拉 ，女神节快乐！', '38.png', '1493564551'),
(16, '磁鼓的鹿', '隔山海的回响，不再强求，愿你和勾勒着远方的姑娘有安谧的岁月。大概很希望你能遇见一个我也觉得很好的人吧。愿你一生努力一生被爱，想要的都拥有，得不到的都释怀，谢谢你。', '29.png', '1493564564');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lovecontent`
--
ALTER TABLE `lovecontent`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
--
-- 使用表AUTO_INCREMENT `lovecontent`
--
ALTER TABLE `lovecontent`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
